CFDEMcoupling-PUBLIC-v2506/tutorials/ParScale/cfdemSolverPisoSTM/packedBedTempParScale/CFD/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
    inlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);;
    }
    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }
}


// ************************************************************************* //
